<?php 
	// +----------------------------------------------------------------------
	// | MSS V1.0 [ 模版商铺系统 ]
	// +----------------------------------------------------------------------
	// | Copyright (c) 2013-2014 四重奏项目组 All rights reserved.
	// +----------------------------------------------------------------------
	// | Licensed SunChi/LAMP兄弟连
	// +----------------------------------------------------------------------
	// | Author: SC
	// | Date:   1/13/2014 16:32
	// +----------------------------------------------------------------------
	
	/**
	* 类名：CartAction
	* 功能：显示购物车状态
	*/
	class CartAction extends Action
	{
		public function cart() 
		{
			R('Base/header');
			R('Base/footer');

			$data = M("goods");
			$tdata = $data->limit(10,17)->select();
			$this->assign("tdata",$tdata);
			$this->display();
		}
	}